Учебное заведение: 4 модуль
2559492
2372321
119
2
18
75
8
540
620
630
710
730
810
820
900
910
990
1000
1080
1090
1170
1180
1260
980
1025
1035
1080
1090
1135
1145
1190
1200
1245
1255
1300
1310
1355
1365
1410
1420
1439
1439
1439
1439
1439
1439
1439
13
100
30
Кочновский п.
Компьютеры, Кочновский
0
123
30
Кочновский п.
Компьютеры, Кочновский
0
128
40
Кочновский п.
Компьютеры, Кочновский, Лабор
0
314
20
Кочновский п.
Кочновский, Лабор
0
322
30
Кочновский п.
Кочновский
0
354
100
Кочновский п.
Компьютеры, Кочновский, Лекции
0
412
20
Кочновский п.
Компьютеры, Кочновский
0
622
200
Кочновский п.
Кочновский, Лекции
0
Зал
300
Кочновский п.
Кочновский, Мероприятия
0
х100
30
Хитровский пер.
Компьютеры, Майнор, Хитровский
0
х101
40
Хитровский пер.
Компьютеры, Майнор, Хитровский
0
х200
30
Хитровский пер.
Майнор, Хитровский
0
х500
100
Хитровский пер.
Лекции, Майнор, Хитровский
0
0
35
Гринкруг Ефим Михайлович
КПО
ТолькоБудни
4
Не(Время(>20:00))
Не(Ауд(622)) //Личная неприязнь к определенной аудитории
МаксВНеделю(10)
ДеньНед(Пятница)
Фомин Сергей Сергеевич
ОС семинарист
НеУтро, ТолькоБудни
0
Харламов Александр Александрович
НИС Нейро
НеУтро
0
Горденко Мария Константиновна
Груп

0
Авдошин Сергей Михайлович
ДМ
ТолькоСуббота
0
Ульянов Михаил Васильевич
ОС лектор
НеУтро
0
Приползина Наталья Викторовна
Англ

0
Береснева Екатерина Николаевна
Груп
ТолькоБудни
0
Звездина Наталья Валерьевна
Стат Майнор
НеУтро
0
Зухба Елена Николаевна
Экон Майнор
НеУтро, ТолькоБудни
0
Преп5

ТолькоСуббота
0
Преп6


0
Преп7


0
Преп8


0
Преп9


0
Преп10


0
Преп11

ТолькоБудни
0
Преп12

ТолькоБудни
0
Преп13


0
Преп14


0
Преп15


0
Преп16


0
Преп17


0
Преп18


0
Преп19


0
Преп20


0
Преп21


0
Преп22


0
Преп23


0
Преп24


0
Преп25


0
Преп26


0
Преп27


0
Преп28


0
Преп29


0
3
НеУтро: Время(>12:00)
ТолькоБудни: ДеньНед(<=Пятница)
ТолькоСуббота: ДеньНед(Суббота)
17
БПИ171
15

Курс2, Основа
0
БПИ172
16

Курс2, Основа
0
БПИ173
17

Курс2, Основа
0
БПИ174
20

Курс2, Основа
0
БПИ175
14

Курс2, Основа
0
МЭК1
30
Майнор Экономика
Курс2, Майнор
0
МЭК2
30
Майнор Экономика
Курс2, Майнор
0
МЭК3
30
Майнор Экономика
Курс2, Майнор
0
МСТ1
40
Майнор Статистика
Курс2, Майнор
0
МСТ2
40
Майнор Статистика
Курс2, Майнор
0
НИС1
35
НИС Нейроинформатика
Курс1, Курс2, НИС
0
БПИ181
12

Курс1, Основа
0
БПИ182
22

Курс1, Основа
0
БПИ183
23

Курс1, Основа
0
БПИ184
24

Курс1, Основа
0
БПИ185
12

Курс1, Основа
0
БПИ186
23

Курс1, Основа
0
3
Майнор: Не(Группа(Основа)) //Т.е. группы пересекаются -> Не позволяет занятиям по майнору проводиться в один момент с основными занятиями
НИС: Ауд(Кочновский)
Основа: Ауд(Кочновский)
34
Групповая Динамика (Лекция)
Береснева Екатерина Николаевна
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
11

Лекция
0
Групповая Динамика (Семинар)
Горденко Мария Константиновна
БПИ171
10

Семинар
0
Групповая Динамика (Семинар)
Береснева Екатерина Николаевна
БПИ172
10

Семинар
0
Групповая Динамика (Семинар)
Горденко Мария Константиновна
БПИ173
10

Семинар
0
Групповая Динамика (Семинар)
Береснева Екатерина Николаевна
БПИ174
10

Семинар
0
Групповая Динамика (Семинар)
Горденко Мария Константиновна
БПИ175
10

Семинар
0
Групповая Динамика (Экзамен)
Береснева Екатерина Николаевна
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
1

Экзамен
0
Конструирование ПО (Лекция)
Гринкруг Ефим Михайлович
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
11

Лекция
0
Конструирование ПО (Семинар)
Гринкруг Ефим Михайлович
БПИ171
10

Компьютеры, Семинар
0
Конструирование ПО (Семинар)
Гринкруг Ефим Михайлович
БПИ172
10

Компьютеры, Семинар
0
Конструирование ПО (Семинар)
Гринкруг Ефим Михайлович
БПИ173
10

Компьютеры, Семинар
0
Конструирование ПО (Семинар)
Гринкруг Ефим Михайлович
БПИ174
10

Компьютеры, Семинар
0
Конструирование ПО (Семинар)
Гринкруг Ефим Михайлович
БПИ175
10

Компьютеры, Семинар
0
Конструирование ПО (Экзамен)
Гринкруг Ефим Михайлович
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
1

Экзамен
0
Английский
Приползина Наталья Викторовна
БПИ171, БПИ172
8

ПрактическоеЗанятие
0
Английский
Приползина Наталья Викторовна
БПИ173, БПИ174, БПИ175
8

ПрактическоеЗанятие
0
Операционные Системы (Лекция)
Ульянов Михаил Васильевич
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
7

Лекция
0
Операционные Системы (Семинар)
Фомин Сергей Сергеевич
БПИ171
6

Компьютеры, Семинар
0
Операционные Системы (Семинар)
Фомин Сергей Сергеевич
БПИ172
6

Компьютеры, Семинар
0
Операционные Системы (Семинар)
Фомин Сергей Сергеевич
БПИ173
6

Компьютеры, Семинар
0
Операционные Системы (Семинар)
Ульянов Михаил Васильевич
БПИ174
6

Компьютеры, Семинар
0
Операционные Системы (Семинар)
Ульянов Михаил Васильевич
БПИ175
6

Компьютеры, Семинар
0
Операционные Системы (Экзамен)
Ульянов Михаил Васильевич
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
1

Компьютеры, Экзамен
0
НИС Нейроинформатика
Харламов Александр Александрович
НИС1
8

НИС
0
НИС Нейроинформатика
Харламов Александр Александрович
НИС1
1

НИС, Экзамен
0
Майнор Экономика (Лекция)
Зухба Елена Николаевна
МЭК1, МЭК2, МЭК3
7

Лекция, Майнор
0
Майнор Экономика (Семинар)
Зухба Елена Николаевна
МЭК1
6

Майнор, Семинар
0
Майнор Экономика (Семинар)
Зухба Елена Николаевна
МЭК2
6

Майнор, Семинар
0
Майнор Экономика (Семинар)
Зухба Елена Николаевна
МЭК3
6

Майнор, Семинар
0
Майнор Экономика (Экзамен)
Зухба Елена Николаевна
МЭК1, МЭК2, МЭК3
1

Майнор, Экзамен
0
Майнор Статистика (Лекция)
Звездина Наталья Валерьевна
МСТ1, МСТ2
7

Лекция, Майнор
0
Майнор Статистика (Семинар)
Звездина Наталья Валерьевна
МСТ1
6

Компьютеры, Майнор, Семинар
0
Майнор Статистика (Семинар)
Звездина Наталья Валерьевна
МСТ2
6

Компьютеры, Майнор, Семинар
0
Майнор Статистика (Экзамен)
Звездина Наталья Валерьевна
МСТ1, МСТ2
1

Майнор, Экзамен
0
6
Все: Не(Или(ДеньНед(Четверг),ДеньНед(Воскресенье)))
Компьютеры: Ауд(Компьютеры) //Все занятия помеченные тегом "Компьютеры" требуют аудитории, которые тоже помечены тегом "Компьютеры"
Майнор: ДеньНед(Среда)
Майнор: Ауд(Хитровский)
НИС: ДеньНед(Вторник)
Экзамен: Дата(>=20.05.19)
600
1
0
5
3
1
0
2
1
15
5
4
3
0
4
1
14
2
21
5
3
5
0
17
1
20
2
1
16
5
1
18
0
1
19
0
0
0
0
1
23
2
0
0
0
0
0
0
0
2
25
12
31
10
2
26
9
30
12
2
27
9
32
10
1
28
9
0
0
0
0
0
0
0
0
0
0
1
7
5
1
8
0
1
9
0
1
10
0
1
11
0
1
12
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
0
5
3
1
0
2
1
15
5
4
3
0
4
1
14
2
21
5
3
5
0
17
1
20
2
1
16
5
1
18
0
1
19
0
0
0
0
1
23
2
0
0
0
0
0
0
0
2
25
12
31
10
2
26
9
30
12
2
27
9
32
10
1
28
9
0
0
0
0
0
0
0
0
0
0
1
7
5
1
8
0
1
9
0
1
10
0
1
11
0
1
12
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
0
5
3
1
0
2
1
15
5
4
3
0
4
1
14
2
21
5
3
5
0
17
1
20
2
1
16
5
1
18
0
1
19
0
0
0
0
1
23
2
0
0
0
0
0
0
0
2
25
12
31
10
2
26
9
30
12
2
27
9
32
10
1
28
9
0
0
0
0
0
0
0
0
0
0
1
7
5
1
8
0
1
9
0
1
10
0
1
11
0
1
12
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
0
5
3
1
0
2
1
15
5
4
3
0
4
1
14
2
21
5
3
5
0
17
1
20
2
1
16
5
1
18
0
1
19
0
0
0
0
1
23
2
0
0
0
0
0
0
0
2
25
12
31
10
2
26
9
30
12
2
27
9
32
10
1
28
9
0
0
0
0
0
0
0
0
0
0
1
7
5
1
8
0
1
9
0
1
10
0
1
11
0
1
12
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
0
5
3
1
0
2
1
15
5
4
3
0
4
1
14
2
21
5
3
5
0
17
1
20
2
1
16
5
1
18
0
1
19
0
0
0
0
1
23
2
0
0
0
0
0
0
0
2
25
12
31
10
2
26
9
30
12
2
27
9
32
10
1
28
9
0
0
0
0
0
0
0
0
0
0
1
7
5
1
8
0
1
9
0
1
10
0
1
11
0
1
12
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
0
5
3
1
0
2
1
15
5
4
3
0
4
1
14
2
21
5
3
5
0
17
1
20
2
1
16
5
1
18
0
1
19
0
0
0
0
1
23
2
0
0
0
0
0
0
0
2
25
12
31
10
2
26
9
30
12
2
27
9
32
10
1
28
9
0
0
0
0
0
0
0
0
0
0
1
7
5
1
8
0
1
9
0
1
10
0
1
11
0
1
12
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
0
5
3
1
0
2
1
15
5
3
3
0
4
1
14
2
1
5
0
1
16
5
0
0
0
0
0
1
23
2
0
0
0
0
0
0
0
1
25
12
1
30
12
0
0
0
0
0
0
0
0
0
0
0
0
1
7
5
1
8
0
1
9
0
1
10
0
1
11
0
1
12
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
0
5
3
1
0
2
1
15
5
3
3
0
4
1
14
2
1
5
0
0
0
0
0
0
0
1
23
2
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
7
5
1
8
0
1
9
0
1
10
0
1
11
0
1
12
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
0
5
2
1
0
2
1
2
3
0
4
1
1
5
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
7
5
1
8
0
1
9
0
1
10
0
1
11
0
1
12
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
0
5
2
1
0
2
1
2
3
0
4
1
1
5
0
1
6
5
1
22
5
0
0
0
0
1
24
2
0
0
0
0
0
0
0
1
29
12
1
33
12
0
0
0
0
0
0
0
0
0
0
0
0
1
7
5
1
8
0
1
9
0
1
10
0
1
11
0
1
12
0
1
13
5
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
0
5
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
7
5
0
0
0
0
0
0
0
