Учебное заведение: 4 модуль
1
2
119
2
18
74
8
540
620
630
710
730
810
820
900
910
990
1000
1080
1090
1170
1180
1260
980
1025
1035
1080
1090
1135
1145
1190
1200
1245
1255
1300
1310
1355
1365
1410
1420
1439
1439
1439
1439
1439
1439
1439
13
100
30
Кочновский п.
Компьютеры
0
123
30
Кочновский п.
Компьютеры
0
128
40
Кочновский п.
Компьютеры, Лабор
0
314
20
Кочновский п.
Лабор
0
322
30
Кочновский п.

0
354
100
Кочновский п.
Компьютеры, Лекции
0
412
20
Кочновский п.
Компьютеры
0
622
200
Кочновский п.
Лекции
0
Зал
300
Кочновский п.
Мероприятия
0
х100
30
Хитровский пер.
Компьютеры, Майнор
0
х101
40
Хитровский пер.
Компьютеры, Майнор
0
х200
30
Хитровский пер.
Майнор
0
х500
100
Хитровский пер.
Лекции, Майнор
0
0
35
Гринкруг Ефим Михайлович
КПО
ТолькоБудни
3
Не(Время(>18:00))
Не(Ауд(622)) //Личная неприязнь к определенной аудитории
МаксВНеделю(10)
Фомин Сергей Сергеевич
ОС семинарист
НеУтро, ТолькоБудни
0
Харламов Александр Александрович
НИС Нейро
НеУтро
0
Горденко Мария Константиновна
Груп

0
Авдошин Сергей Михайлович
ДМ
ТолькоСуббота
0
Ульянов Михаил Васильевич
ОС лектор
НеУтро
0
Приползина Наталья Викторовна
Англ

0
Береснева Екатерина Николаевна
Груп
ТолькоБудни
0
Звездина Наталья Валерьевна
Стат Майнор
НеУтро
0
Зухба Елена Николаевна
Экон Майнор
НеУтро, ТолькоБудни
0
Преп5

ТолькоСуббота
0
Преп6


0
Преп7


0
Преп8


0
Преп9


0
Преп10


0
Преп11

ТолькоБудни
0
Преп12

ТолькоБудни
0
Преп13


0
Преп14


0
Преп15


0
Преп16


0
Преп17


0
Преп18


0
Преп19


0
Преп20


0
Преп21


0
Преп22


0
Преп23


0
Преп24


0
Преп25


0
Преп26


0
Преп27


0
Преп28


0
Преп29


0
3
НеУтро: Время(>12:00)
ТолькоБудни: ДеньНед(<=Пятница)
ТолькоСуббота: ДеньНед(Суббота)
17
БПИ171
15

Курс2, Основа
0
БПИ172
16

Курс2, Основа
0
БПИ173
17

Курс2, Основа
0
БПИ174
20

Курс2, Основа
0
БПИ175
14

Курс2, Основа
0
МЭК1
30
Майнор Экономика
Курс2, Майнор
0
МЭК2
30
Майнор Экономика
Курс2, Майнор
0
МЭК3
30
Майнор Экономика
Курс2, Майнор
0
МСТ1
40
Майнор Статистика
Курс2, Майнор
0
МСТ2
40
Майнор Статистика
Курс2, Майнор
0
НИС1
35
НИС Нейроинформатика
Курс1, Курс2, НИС
0
БПИ181
12

Курс1, Основа
0
БПИ182
22

Курс1, Основа
0
БПИ183
23

Курс1, Основа
0
БПИ184
24

Курс1, Основа
0
БПИ185
12

Курс1, Основа
0
БПИ186
23

Курс1, Основа
0
1
Майнор: Не(Группа(Основа)) //Т.е. группы пересекаются -> Не позволяет занятиям по майнору проводиться в один момент с основными занятиями
34
Групповая Динамика
Береснева Екатерина Николаевна
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
11

Лекция
0
Групповая Динамика
Горденко Мария Константиновна
БПИ171
10

Семинар
0
Групповая Динамика
Береснева Екатерина Николаевна
БПИ172
10

Семинар
0
Групповая Динамика
Горденко Мария Константиновна
БПИ173
10

Семинар
0
Групповая Динамика
Береснева Екатерина Николаевна
БПИ174
10

Семинар
0
Групповая Динамика
Горденко Мария Константиновна
БПИ175
10

Семинар
0
Групповая Динамика
Береснева Екатерина Николаевна
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
1

Экзамен
0
Конструирование ПО
Гринкруг Ефим Михайлович
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
11

Лекция
0
Конструирование ПО
Гринкруг Ефим Михайлович
БПИ171
10

Компьютеры, Семинар
0
Конструирование ПО
Гринкруг Ефим Михайлович
БПИ172
10

Компьютеры, Семинар
0
Конструирование ПО
Гринкруг Ефим Михайлович
БПИ173
10

Компьютеры, Семинар
0
Конструирование ПО
Гринкруг Ефим Михайлович
БПИ174
10

Компьютеры, Семинар
0
Конструирование ПО
Гринкруг Ефим Михайлович
БПИ175
10

Компьютеры, Семинар
0
Конструирование ПО
Гринкруг Ефим Михайлович
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
1

Экзамен
0
Английский
Приползина Наталья Викторовна
БПИ171, БПИ172
8

ПрактическоеЗанятие
0
Английский
Приползина Наталья Викторовна
БПИ173, БПИ174, БПИ175
8

ПрактическоеЗанятие
0
Операционные Системы
Ульянов Михаил Васильевич
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
7

Лекция
0
Операционные Системы
Фомин Сергей Сергеевич
БПИ171
6

Компьютеры, Семинар
0
Операционные Системы
Фомин Сергей Сергеевич
БПИ172
6

Компьютеры, Семинар
0
Операционные Системы
Фомин Сергей Сергеевич
БПИ173
6

Компьютеры, Семинар
0
Операционные Системы
Ульянов Михаил Васильевич
БПИ174
6

Компьютеры, Семинар
0
Операционные Системы
Ульянов Михаил Васильевич
БПИ175
6

Компьютеры, Семинар
0
Операционные Системы
Ульянов Михаил Васильевич
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
1

Компьютеры, Экзамен
0
НИС Нейроинформатика
Харламов Александр Александрович
НИС1
8

НИС
0
НИС Нейроинформатика
Харламов Александр Александрович
НИС1
1

НИС, Экзамен
0
Майнор Экономика
Зухба Елена Николаевна
МЭК1, МЭК2, МЭК3
7

Лекция
0
Майнор Экономика
Зухба Елена Николаевна
МЭК1
6

Семинар
0
Майнор Экономика
Зухба Елена Николаевна
МЭК2
6

Семинар
0
Майнор Экономика
Зухба Елена Николаевна
МЭК3
6

Семинар
0
Майнор Экономика
Зухба Елена Николаевна
МЭК1, МЭК2, МЭК3
1

Экзамен
0
Майнор Статистика
Звездина Наталья Валерьевна
МСТ1, МСТ2
7

Лекция
0
Майнор Статистика
Звездина Наталья Валерьевна
МСТ1
6

Компьютеры, Семинар
0
Майнор Статистика
Звездина Наталья Валерьевна
МСТ2
6

Компьютеры, Семинар
0
Майнор Статистика
Звездина Наталья Валерьевна
МСТ1, МСТ2
1

Экзамен
0
6
Все: Не(Или(ДеньНед(Четверг),ДеньНед(Воскресенье)))
Все: Не(Дата(09.05.19))
Компьютеры: Ауд(Компьютеры) //Все занятия помеченные тегом "Компьютеры" требуют аудитории, которые тоже помечены тегом "Компьютеры"
Майнор: ДеньНед(Среда)
НИС: ДеньНед(Вторник)
Экзамен: Дата(>=20.05.19)
592
2
4
10
22
0
0
0
0
0
0
1
8
11
1
29
1
0
0
0
0
0
0
1
14
8
1
2
9
0
1
14
12
0
0
0
1
17
7
1
21
7
0
0
1
25
4
0
0
1
32
9
1
7
8
1
15
2
3
8
3
11
12
26
10
0
0
0
0
0
0
0
0
1
18
5
0
1
10
11
0
0
0
0
0
1
32
4
2
11
7
30
1
1
16
9
0
1
9
8
1
10
10
0
0
1
15
5
1
12
3
1
5
11
0
1
15
8
0
1
3
5
0
1
33
7
0
1
3
12
0
0
0
0
0
1
30
12
1
25
10
0
2
2
5
4
4
0
1
16
4
3
9
1
12
11
31
10
0
0
0
1
8
0
1
20
10
0
0
0
0
0
1
7
2
0
0
0
1
10
10
1
23
4
0
0
2
19
8
32
11
0
0
0
0
1
0
5
0
0
1
10
10
1
12
3
1
19
11
1
0
4
0
0
2
9
9
11
9
0
0
1
9
2
1
0
2
0
1
15
7
1
31
5
0
0
1
19
11
0
0
0
1
3
3
0
0
1
5
1
0
0
1
1
12
0
0
0
1
11
12
0
0
0
0
0
1
2
5
3
11
0
15
0
30
3
0
0
0
0
0
2
17
4
28
9
0
2
14
9
14
11
0
2
3
11
21
2
1
1
2
0
0
0
0
1
21
12
0
1
8
7
0
1
30
9
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
1
11
9
1
5
10
1
7
8
0
0
0
1
2
8
0
0
0
1
30
1
1
3
12
2
0
0
27
8
0
0
0
0
1
2
6
1
25
2
0
1
28
11
1
18
8
0
0
1
30
12
0
0
0
0
0
0
0
2
7
1
9
12
0
0
0
0
1
3
4
0
0
0
1
16
2
0
1
9
1
0
1
21
12
1
4
12
0
0
1
15
8
0
0
1
14
2
0
0
0
2
8
2
10
10
0
0
0
0
0
0
0
0
0
1
26
3
0
0
0
0
2
0
11
1
5
0
0
1
32
12
0
0
1
28
3
0
0
2
4
8
12
1
0
0
1
14
7
0
0
2
5
1
14
4
0
0
2
2
0
19
7
1
25
9
1
12
2
1
4
0
0
0
0
1
17
2
0
1
20
1
0
0
0
0
1
10
7
1
6
9
0
1
8
8
1
25
5
1
19
8
0
1
1
3
0
0
0
0
0
0
0
1
20
9
1
15
0
2
18
11
27
8
0
1
27
2
0
1
31
3
0
1
4
11
0
0
0
0
0
1
31
4
0
0
0
0
2
3
4
16
11
0
1
7
11
0
1
0
11
1
23
10
0
0
0
0
0
0
1
5
3
0
1
4
10
1
0
7
0
0
0
1
11
12
0
0
0
0
1
9
7
0
0
0
0
0
1
23
6
0
1
31
4
1
0
12
0
1
11
10
0
0
0
1
2
4
1
11
10
0
1
1
10
0
1
28
7
0
0
2
1
1
9
1
0
0
0
1
26
6
1
27
6
0
1
15
11
1
28
12
0
0
0
1
1
10
0
1
17
9
0
0
0
1
32
4
0
0
1
23
5
0
0
0
0
0
1
23
6
1
13
3
0
0
0
1
0
8
0
0
0
0
0
2
23
6
25
10
1
11
12
0
0
0
0
0
1
8
12
0
0
2
2
2
7
2
0
1
1
0
0
0
0
2
4
8
26
6
0
0
0
1
1
5
1
20
1
0
0
0
1
2
4
0
0
0
0
0
1
25
2
0
0
0
0
0
2
8
3
16
6
0
0
0
0
0
0
0
1
7
0
0
0
0
0
2
0
3
12
0
1
20
5
0
0
0
0
1
5
6
0
0
0
0
0
0
0
0
1
10
5
0
0
1
7
4
2
4
5
8
3
0
1
26
12
0
0
0
0
0
0
1
16
12
2
12
4
26
4
1
5
5
0
0
0
0
0
1
23
2
1
9
9
0
2
0
3
17
1
0
0
0
1
7
8
0
0
0
1
12
6
0
1
5
4
2
23
11
30
10
0
0
0
1
3
2
0
0
0
0
0
1
10
9
1
10
8
0
0
0
3
12
7
19
2
21
11
0
1
14
1
1
2
6
2
16
10
24
0
0
2
27
2
31
7
1
21
10
0
0
0
1
5
1
0
1
5
2
0
0
0
1
12
10
0
0
0
0
0
1
18
3
0
1
1
6
1
20
12
0
1
17
8
0
1
27
5
0
0
1
3
8
0
0
0
0
0
0
1
4
10
1
7
11
0
0
0
1
32
3
1
8
7
0
2
18
2
28
9
0
0
0
0
0
0
0
0
0
0
0
0
0
1
10
0
0
0
0
1
18
6
0
0
0
0
1
3
5
0
1
9
0
1
7
11
