Учебное заведение: 1 Семестр
2559492
2372321
119
2
14
70
9
540
585
595
640
650
695
705
750
760
805
815
860
870
915
925
970
980
1025
1035
1080
1090
1135
1145
1190
1200
1245
1255
1300
1310
1355
1365
1410
1420
1439
1439
1439
1439
1439
1439
1439
6
100
30
Кочновский п.
Компьютеры
0
128
40
Кочновский п.
Компьютеры, Лабор
0
314
20
Кочновский п.
Лабор
0
322
30
Кочновский п.

0
354
100
Кочновский п.
Компьютеры, Лекции
0
622
200
Кочновский п.
Лекции
0
0
3
Гринкруг Ефим Михайлович
КПО
ТолькоБудни
0
Горденко Мария Константиновна
Груп

1
Не(Время(<14:00))
Береснева Екатерина Николаевна
Груп
ТолькоБудни
0
1
ТолькоБудни: Не(ДеньНед(>Пятница))
5
БПИ171
15

Курс2, Основа
0
БПИ172
16

Курс2, Основа
0
БПИ173
17

Курс2, Основа
0
БПИ174
20

Курс2, Основа
0
БПИ175
14

Курс2, Основа
0
0
5
Групповая Динамика
Береснева Екатерина Николаевна
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
11

Лекция
0
Групповая Динамика
Горденко Мария Константиновна
БПИ171
10

Семинар
0
Групповая Динамика
Береснева Екатерина Николаевна
БПИ172
10

Семинар
0
Групповая Динамика
Горденко Мария Константиновна
БПИ173
10

Семинар
0
Групповая Динамика
Береснева Екатерина Николаевна
БПИ171, БПИ172, БПИ173, БПИ174, БПИ175
1

Экзамен
1
Дата(>20.04.19)
1
Все: Не(ДеньНед(Воскресенье))
0
